import React from "react";

import { AppWrapper } from "../../wrapper";
import "./Prices.scss";

const Prices = () => {
  return (
    <>
      <div className="section__heading">
        <h2>أسعار الشحن</h2>
      </div>
      <div className="app__prices">
        <div className="app__prices-items">
          <div className="app__prices-item">
            <h3>الأثاث</h3>
            <span>150 درهم</span>
            <p>
              يمكنك دائمًا متابعة شحنتك عبر موقعنا لتعلم إلى أين وصلت، وأذا وجدت
              أن حالة الشحنة في الموقع تم التسليم وهي لم تصل بعد يمكنك الأنتظار
              من 6 الى 12 ساعة والعودة مجددًا للتأكد من الحالة، أن كانت المشكلة
              ما تزال قائمة يمكنك التواصل مع الدعم وسيعمل على حل المشكلة في أسرع
              وقت.
            </p>
          </div>

          <div className="app__prices-item selected">
            <h3>الأثاث</h3>
            <span>230 درهم</span>
            <p>
              يمكنك دائمًا متابعة شحنتك عبر موقعنا لتعلم إلى أين وصلت، وأذا وجدت
              أن حالة الشحنة في الموقع تم التسليم وهي لم تصل بعد يمكنك الأنتظار
              من 6 الى 12 ساعة والعودة مجددًا للتأكد من الحالة، أن كانت المشكلة
              ما تزال قائمة يمكنك التواصل مع الدعم وسيعمل على حل المشكلة في أسرع
              وقت.
            </p>
          </div>

          <div className="app__prices-item">
            <h3>الأثاث</h3>
            <span>500 درهم</span>
            <p>
              يمكنك دائمًا متابعة شحنتك عبر موقعنا لتعلم إلى أين وصلت، وأذا وجدت
              أن حالة الشحنة في الموقع تم التسليم وهي لم تصل بعد يمكنك الأنتظار
              من 6 الى 12 ساعة والعودة مجددًا للتأكد من الحالة، أن كانت المشكلة
              ما تزال قائمة يمكنك التواصل مع الدعم وسيعمل على حل المشكلة في أسرع
              وقت.
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default AppWrapper(Prices);
