import React from "react";

import images from "../../images";
import { AppWrapper } from "../../wrapper";
import "./Sec1.scss";

const Sec1 = () => {
  return (
    <div className="app__sec1">
      <div className="app__sec1-block1">
        <div className="img-container">
          <img src={images.horizontal1} alt="image1" />
        </div>
        <div className="content">
          <h3>هل أرسلت شحنة من قبل ووصلت محطمة؟</h3>
          <p>
            لا تقلق، هذهِ المشكلة أزالية وتواجه كل مغترب يحاول أرسال أغراضه من
            الإمارات العربية المتحدة إلى مصر، ويعود ذلك لعدد من الأسباب أبرزها:
            عدم الأهتمام بالتغليف وضعف الخامات المستخدمه فيه، عدم التعامل
            بالإحترافية الازمة مع الأجهزة وقطع الأثاث الحساسة، عدم تدريب العمالة
            بالشكل الازم والذي ينتج عنه ما سبق وغيرها من مشكلات. لكن الآن مع
            المروج للشحن أصبحت هذه المشاكل ذكريات من الماضي وذلك لأننا عندما
            بدأنا كان لدينا علم بهذه المشاكل وعملنا على حلها من خلال تدريب
            فريقنا المختص على التعامل مع أنواع الشحنات المختلفة، وكذلك قمنا
            بتطوير وأستخدام أفضل خامات التغليف وأساليب الفك والتغليف والشحن
            لضمان وصول شحنتك كما سلمتها لنا.
          </p>
        </div>
      </div>

      <div className="app__sec1-block2">
        <div className="img-container">
          <img src={images.horizontal2} alt="image2" />
        </div>
        <div className="content">
          <h3>هل أردت من قبل أن تعرف إلى أين وصلت شحنتك؟</h3>
          <p>
            لطلما كانت أمنية كل عميل أن يكون هناك إمكانية توفر خيار أكثر عملية
            للإستعلام عن شحنته وإلى أين وصلت غير الأتصال الهاتفي والطرق
            التقليدية الآخرى، ولكن مع ذلك تشعر أن عجلة الأبتكار توقفت عند هذا
            الأمر وذلك يعود لصعوبة الأمر لوجستيًا وتقنيًا، ولكن مع المروج للشحن
            يمكنك الآن متابعة شحنتك من خلال موقعنا الإلكتروني بكل سهولة وذلك من
            بداية إستلام الفريق المختص لها وحتى تصل إلى العنوان المراد إيصالها
            إليه، فقط بعد إدخالك لرقم التتبع الخاص بشحنتك في المكان المخصص له في
            الشريط العلوي للصفحة الرئيسية.
          </p>
        </div>
      </div>

      <div className="app__sec1-block3">
        <div className="img-container">
          <img src={images.horizontal3} alt="image3" />
        </div>
        <div className="content">
          <h3>هل أصبت بخيبة أمل بعد إرسال شحنتك وعلمت أنها فقدت؟</h3>
          <p>
            هذه المشكلة من أهم وأبرز المشاكل والتى لا يمكن المسامحة فيها والتى
            ينتج عنها خيبة أمل مفهومة، وتحدث في الغالب بسبب عدم وجود سيستم قوي
            وفعال في التعامل مع الشحنات وترتيبها وتنسيقها وكذا فقدان المتابعة
            الدورية لضمان عدم فقدها أثناء الشحن والتفريغ أو في الميناء سواء
            الجوي أو البحري، ولذلك عملنا في المروج للشحن على بناء سيستم فعال
            وواضح لكافة فرق العمل اللوجستية لآلية التعامل مع الشحنات من بداية
            أستلامها مرورًا بتغليفها وشحنها وصولًا الى تسليمها، وكذلك عملنا على
            توفير المتابعة الدورية لضمان عدم سرقة بعض الأغراض من الشحنات ولتأمين
            وصول الشحنات وتفادي فقدانها لأي سبب كان.
          </p>
        </div>
      </div>
    </div>
  );
};

export default AppWrapper(Sec1);
